{
    "id":1,
    "name": "Perché ho creato uno spazio personale",
    "version": "1.0.0",
    "date": "2022-04-15",
    "text": "<p>Benvenuti al primo post di questo blog-like e sul mio sito, dove aggiungerò post contenenti impressioni, apprezzamenti, novità personali o anche recensioni.</p>\n<p>Rispondendo alla domanda sul titolo, principalmente ho fatto tutto questo perché volevo avere uno spazio personale multifunzionale per far girare qualunque cosa voglia (tempo e risorse permettendo), e così ho comprato questo dominio per questo scopo, sperando di poter fare bella figura non solo con gli amici online, ma anche \"in real life\", per avere un seguito che non sia limitato sui social che sinceramente non apprezzo tanto usare sia per pigrizia che per limite su cosa è possibile farci sopra.</p><p>Insomma, così pensavo che studiare linguaggi come SASS o Javascript e ripassare HTML e CSS potesse essere un modo migliore per esprimere me stesso, sebbene la mia scarsa immaginazione, pazienza e abilità in graphic design (草) non aiuteranno di certo ad abbellire di più il sito, ma almeno sto puntando a farlo funzionare e ciò mi basta.</p><p>Piccolo aneddoto: avevo una sottospecie di blog quando andavo in scuola media, perché in concomitanza alla creazione di un account Live per usarlo con Windows Live Messenger con i compagni di classe (usata pure poco e male come prima chat per gli amici) ho pure aperto un Windows Live Spaces per postare robette come foto di Asia (quando dici che internet è fatto del 40% di foto di gattini ed ero pure uno di loro) o di gadget provenienti dalla zia Emanuela, tutte foto che facevo con il decente (o almeno lo era per quel tempo) e fidato Samsung Omnia.</p><p>Purtroppo il blog durò relativamente poco perché Microsoft stava già pianificando di chiudere il servizio non prima di proporre agli utenti via mail di poter migrare su WordPress (草) da settembre 2010 fino a marzo dell'anno successivo, ma decisi al tempo che non ne sarebbe valsa la pena, così lasciai tutto a morire con il solo ricordo la cartella esportata su OneDrive (al tempo si chiamava ancora Skydrive) dellefoto presenti sul mio Spaces.</p><p>Ultima domanda in cui mi soffermo su questo post, perché proprio ora, in questo periodo, mi creo un blog personale? Perché ora sia le finanze che la testa mi concedono di poter fare tutto questo, anche solo per diletto o esercizio di stile (quale poi...) o passatempo o per sfogo. Eh già, ho anche bisogno di sfogarmi scrivendo maniacalmente nonsense su una tastiera, cercando di risparmiare Inode per altri componenti sul sito quali Webserver o qualunque cosa ci faccio girare sopra</p>"
}